# Pandas

- A pandas Series  is like a column in a table. 
- It is one- dimentional array holding data of any type.

In [1]:
import pandas as pd

In [2]:
# Series Method

Series=pd.Series([1,2,3,4,5])
Series

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
# Series Method with Index:

ser=pd.Series([1,2,3,4],index=['a','b','c','d'])
ser

a    1
b    2
c    3
d    4
dtype: int64

## Accessing Series elements

In [5]:
print(ser['a'])

1

In [6]:
print(ser['d'])

4

In [7]:
Series[0]

1

##  Pandas Data Frame

- A Data Frame is a two dimentional data structure. i.e data is alligned in a tabular fashion in rows and columns

In [10]:
# Data Frame Methos on list

data=pd.DataFrame([1,2,3,4,5],columns=['Values'])
print(data)

   Values
0       1
1       2
2       3
3       4
4       5

In [12]:
# Data Frame using Dictionary

data=pd.DataFrame({"Name":['Tom','Jack','Steve','Ricky','Sam','Will','Root'],'Age':[10,12,31,41,32,32,45]})
data

    Name  Age
0    Tom   10
1   Jack   12
2  Steve   31
3  Ricky   41
4    Sam   32
5   Will   32
6   Root   45

In [13]:
# top 5
data.head()

    Name  Age
0    Tom   10
1   Jack   12
2  Steve   31
3  Ricky   41
4    Sam   32

In [14]:
# below 5
data.tail()

    Name  Age
2  Steve   31
3  Ricky   41
4    Sam   32
5   Will   32
6   Root   45

In [15]:
data1=pd.DataFrame({"Name":['Tom','Jack','Steve','Ricky','Sam','Will','Root'],'Age':[10,12,31,41,32,32,45]},
                  index=['C1','C2','C3','C4','C5','C6','C7'])
data1

     Name  Age
C1    Tom   10
C2   Jack   12
C3  Steve   31
C4  Ricky   41
C5    Sam   32
C6   Will   32
C7   Root   45

In [16]:
# column Selection
data['Name']

0      Tom
1     Jack
2    Steve
3    Ricky
4      Sam
5     Will
6     Root
Name: Name, dtype: object

In [17]:
data['Age']

0    10
1    12
2    31
3    41
4    32
5    32
6    45
Name: Age, dtype: int64

In [18]:
data1['Name']

C1      Tom
C2     Jack
C3    Steve
C4    Ricky
C5      Sam
C6     Will
C7     Root
Name: Name, dtype: object

In [22]:
# Row Selection
data1.loc['C1':'C5',['Name','Age']] # rows , column

     Name  Age
C1    Tom   10
C2   Jack   12
C3  Steve   31
C4  Ricky   41
C5    Sam   32

In [25]:
data.iloc[0:5,0]

0      Tom
1     Jack
2    Steve
3    Ricky
4      Sam
Name: Name, dtype: object

In [28]:
print(data1.loc["C4",["Name","Age"]])

Name    Ricky
Age        41
Name: C4, dtype: object

## Pandas Concate

In [31]:
names=pd.DataFrame({"Name":['N1','N2','N3','N4','N5','N6']})
age=pd.DataFrame({"Age":[21,23,34,31,28,39]})

print("Data Frame 1'\n'",names,"'\n\n'Data Frame 2'\n'",age)

Data Frame 1'
'   Name
0   N1
1   N2
2   N3
3   N4
4   N5
5   N6 '

'Data Frame 2'
'    Age
0   21
1   23
2   34
3   31
4   28
5   39

# axis=1 "Horizontal"

In [41]:
# Must have equal number of columns
pd.concat([names,age],axis=1) # by Horizontally

  Name  Age
0   N1   21
1   N2   23
2   N3   34
3   N4   31
4   N5   28
5   N6   39

# axis=0 "Verically"

In [48]:
pd.concat([names,data],axis=0).reset_index()

    index   Name   Age
0       0     N1   NaN
1       1     N2   NaN
2       2     N3   NaN
3       3     N4   NaN
4       4     N5   NaN
5       5     N6   NaN
6       0    Tom  10.0
7       1   Jack  12.0
8       2  Steve  31.0
9       3  Ricky  41.0
10      4    Sam  32.0
11      5   Will  32.0
12      6   Root  45.0

In [47]:
pd.concat([names,data],axis=0,ignore_index="True")

     Name   Age
0      N1   NaN
1      N2   NaN
2      N3   NaN
3      N4   NaN
4      N5   NaN
5      N6   NaN
6     Tom  10.0
7    Jack  12.0
8   Steve  31.0
9   Ricky  41.0
10    Sam  32.0
11   Will  32.0
12   Root  45.0

In [49]:
df=data.copy()
df

    Name  Age
0    Tom   10
1   Jack   12
2  Steve   31
3  Ricky   41
4    Sam   32
5   Will   32
6   Root   45

In [50]:
df['Name']

0      Tom
1     Jack
2    Steve
3    Ricky
4      Sam
5     Will
6     Root
Name: Name, dtype: object

In [52]:
df[['Name','Age']]

    Name  Age
0    Tom   10
1   Jack   12
2  Steve   31
3  Ricky   41
4    Sam   32
5   Will   32
6   Root   45

In [56]:
df[df['Age']<18]

   Name  Age
0   Tom   10
1  Jack   12

In [62]:
df[df['Age']<18]['Name']

0     Tom
1    Jack
Name: Name, dtype: object

In [65]:
df.iloc[:,0:1]

    Name
0    Tom
1   Jack
2  Steve
3  Ricky
4    Sam
5   Will
6   Root

In [67]:
df.loc[:,['Age']]

   Age
0   10
1   12
2   31
3   41
4   32
5   32
6   45

# Creating , Reading Files

In [68]:
import pandas as pd

In [69]:
data=pd.DataFrame({"Name":['Ankit',"Aishwarya","Sanket","Shivangi","Saiprashad","Rishika","Pratiksha"],
                   "Age":[23,21,22,21,22,21,20],
                  "University":['A',"B","C","A","A","B","D"]})
data

         Name  Age University
0       Ankit   23          A
1   Aishwarya   21          B
2      Sanket   22          C
3    Shivangi   21          A
4  Saiprashad   22          A
5     Rishika   21          B
6   Pratiksha   20          D

In [74]:
# save to disk
data.to_csv("Stud.csv")

In [77]:
# save to disk
data.to_csv("student.csv",index=False)

In [79]:
pd.read_csv("Stud.csv")

   Unnamed: 0        Name  Age University
0           0       Ankit   23          A
1           1   Aishwarya   21          B
2           2      Sanket   22          C
3           3    Shivangi   21          A
4           4  Saiprashad   22          A
5           5     Rishika   21          B
6           6   Pratiksha   20          D

In [78]:
new_data=pd.read_csv("student.csv")
new_data

         Name  Age University
0       Ankit   23          A
1   Aishwarya   21          B
2      Sanket   22          C
3    Shivangi   21          A
4  Saiprashad   22          A
5     Rishika   21          B
6   Pratiksha   20          D

#  Date Range Function

In [80]:
# Year-Month-Date - Day Frequency
pd.date_range(start="2020-02-01",end='2020-02-10',freq='D')

DatetimeIndex(['2020-02-01', '2020-02-02', '2020-02-03', '2020-02-04',
               '2020-02-05', '2020-02-06', '2020-02-07', '2020-02-08',
               '2020-02-09', '2020-02-10'],
              dtype='datetime64[ns]', freq='D')

In [81]:
# Month Frequency
pd.date_range(start='2021-02-01',end='2021-12-01',freq='M')

DatetimeIndex(['2021-02-28', '2021-03-31', '2021-04-30', '2021-05-31',
               '2021-06-30', '2021-07-31', '2021-08-31', '2021-09-30',
               '2021-10-31', '2021-11-30'],
              dtype='datetime64[ns]', freq='M')

In [85]:
# Weekdays Frequency
pd.date_range(start='2024-02-02',end='2024-03-02',freq='B')

DatetimeIndex(['2024-02-02', '2024-02-05', '2024-02-06', '2024-02-07',
               '2024-02-08', '2024-02-09', '2024-02-12', '2024-02-13',
               '2024-02-14', '2024-02-15', '2024-02-16', '2024-02-19',
               '2024-02-20', '2024-02-21', '2024-02-22', '2024-02-23',
               '2024-02-26', '2024-02-27', '2024-02-28', '2024-02-29',
               '2024-03-01'],
              dtype='datetime64[ns]', freq='B')

In [1]:
import pandas as pd

In [2]:
df=pd.DataFrame({"Name":['Ankit','Aishwarya','Sanket','Shivangi','Saiprashad','Rishika','Pratiksha'],
                "Age":[23,21,22,21,22,21,20],
                "University":['BHU','JNU','DU','BHU','SPPU','SPPU','DU']})

df

         Name  Age University
0       Ankit   23        BHU
1   Aishwarya   21        JNU
2      Sanket   22         DU
3    Shivangi   21        BHU
4  Saiprashad   22       SPPU
5     Rishika   21       SPPU
6   Pratiksha   20         DU

In [3]:
# create New Columns

df['City']=['Delhi','Banglore','Chennai','Patna','Pune','Pune','Mumbai']

In [4]:
df.head()

         Name  Age University      City
0       Ankit   23        BHU     Delhi
1   Aishwarya   21        JNU  Banglore
2      Sanket   22         DU   Chennai
3    Shivangi   21        BHU     Patna
4  Saiprashad   22       SPPU      Pune

In [5]:
df1=df.copy()
df1.sample(1)

        Name  Age University      City
1  Aishwarya   21        JNU  Banglore

In [8]:
df.columns=["NAME","AGE","UNIVERSITY","CITY"]

In [15]:
df

         NAME  AGE UNIVERSITY      CITY
0       Ankit   23        BHU     Delhi
1   Aishwarya   21        JNU  Banglore
2      Sanket   22         DU   Chennai
3    Shivangi   21        BHU     Patna
4  Saiprashad   22       SPPU      Pune
5     Rishika   21       SPPU      Pune
6   Pratiksha   20         DU    Mumbai

In [10]:
# Temparory Drop

df.drop(['AGE'],axis=1) # axis=1 is column

         NAME UNIVERSITY      CITY
0       Ankit        BHU     Delhi
1   Aishwarya        JNU  Banglore
2      Sanket         DU   Chennai
3    Shivangi        BHU     Patna
4  Saiprashad       SPPU      Pune
5     Rishika       SPPU      Pune
6   Pratiksha         DU    Mumbai

In [11]:
df.sample()

     NAME  AGE UNIVERSITY     CITY
2  Sanket   22         DU  Chennai

In [17]:
# changes to made permanent

df.drop(['AGE'],axis=1,inplace=True)
df

         NAME UNIVERSITY      CITY
0       Ankit        BHU     Delhi
1   Aishwarya        JNU  Banglore
2      Sanket         DU   Chennai
3    Shivangi        BHU     Patna
4  Saiprashad       SPPU      Pune
5     Rishika       SPPU      Pune
6   Pratiksha         DU    Mumbai

In [18]:
# create new column
df['Marks']=[201,210,195,183,225,203,190]

In [19]:
df

         NAME UNIVERSITY      CITY  Marks
0       Ankit        BHU     Delhi    201
1   Aishwarya        JNU  Banglore    210
2      Sanket         DU   Chennai    195
3    Shivangi        BHU     Patna    183
4  Saiprashad       SPPU      Pune    225
5     Rishika       SPPU      Pune    203
6   Pratiksha         DU    Mumbai    190

In [22]:
df.rename(columns={"Marks":"MARKS"},inplace=True)

In [23]:
df.sample()

       NAME UNIVERSITY   CITY  MARKS
3  Shivangi        BHU  Patna    183

In [25]:
# we will check the average marks out of 5 subject
df['Marks']=df['MARKS'].apply(lambda x:x/5)

# to replace the data on MARKS column only we can use df['MARKS']=df['column Name'].apply(lambda x:x/5)

In [26]:
df

         NAME UNIVERSITY      CITY  MARKS  Marks
0       Ankit        BHU     Delhi    201   40.2
1   Aishwarya        JNU  Banglore    210   42.0
2      Sanket         DU   Chennai    195   39.0
3    Shivangi        BHU     Patna    183   36.6
4  Saiprashad       SPPU      Pune    225   45.0
5     Rishika       SPPU      Pune    203   40.6
6   Pratiksha         DU    Mumbai    190   38.0

In [28]:
# rename column
df.rename(columns={"Marks":"Marks Per Subject"},inplace=True)

In [30]:
df.sample()

        NAME UNIVERSITY    CITY  MARKS  Marks Per Subject
6  Pratiksha         DU  Mumbai    190               38.0

In [34]:
# Customize Index:

df.index=list(range(1,8))

In [35]:
df

         NAME UNIVERSITY      CITY  MARKS  Marks Per Subject
1       Ankit        BHU     Delhi    201               40.2
2   Aishwarya        JNU  Banglore    210               42.0
3      Sanket         DU   Chennai    195               39.0
4    Shivangi        BHU     Patna    183               36.6
5  Saiprashad       SPPU      Pune    225               45.0
6     Rishika       SPPU      Pune    203               40.6
7   Pratiksha         DU    Mumbai    190               38.0

In [36]:
# ascending is True will sort data low to high
df.sort_index()

         NAME UNIVERSITY      CITY  MARKS  Marks Per Subject
1       Ankit        BHU     Delhi    201               40.2
2   Aishwarya        JNU  Banglore    210               42.0
3      Sanket         DU   Chennai    195               39.0
4    Shivangi        BHU     Patna    183               36.6
5  Saiprashad       SPPU      Pune    225               45.0
6     Rishika       SPPU      Pune    203               40.6
7   Pratiksha         DU    Mumbai    190               38.0

In [37]:
# will sort data high to low

df.sort_index(ascending=False)

         NAME UNIVERSITY      CITY  MARKS  Marks Per Subject
7   Pratiksha         DU    Mumbai    190               38.0
6     Rishika       SPPU      Pune    203               40.6
5  Saiprashad       SPPU      Pune    225               45.0
4    Shivangi        BHU     Patna    183               36.6
3      Sanket         DU   Chennai    195               39.0
2   Aishwarya        JNU  Banglore    210               42.0
1       Ankit        BHU     Delhi    201               40.2

In [39]:
df.sort_values(by="MARKS")

         NAME UNIVERSITY      CITY  MARKS  Marks Per Subject
4    Shivangi        BHU     Patna    183               36.6
7   Pratiksha         DU    Mumbai    190               38.0
3      Sanket         DU   Chennai    195               39.0
1       Ankit        BHU     Delhi    201               40.2
6     Rishika       SPPU      Pune    203               40.6
2   Aishwarya        JNU  Banglore    210               42.0
5  Saiprashad       SPPU      Pune    225               45.0

In [40]:
df.sort_values(by="MARKS",ascending=False)
# top Marks

         NAME UNIVERSITY      CITY  MARKS  Marks Per Subject
5  Saiprashad       SPPU      Pune    225               45.0
2   Aishwarya        JNU  Banglore    210               42.0
6     Rishika       SPPU      Pune    203               40.6
1       Ankit        BHU     Delhi    201               40.2
3      Sanket         DU   Chennai    195               39.0
7   Pratiksha         DU    Mumbai    190               38.0
4    Shivangi        BHU     Patna    183               36.6

# Data Cleansing

In [41]:
import pandas as pd
import numpy as np

In [42]:
df=pd.read_csv("diabetes.csv")
df.head()

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,6,148,72,35,0,33.6,0.627,50,1
1,1,85,66,29,0,26.6,0.351,31,0
2,8,183,64,0,0,23.3,0.672,32,1
3,1,89,66,23,94,28.1,0.167,21,0
4,0,137,40,35,168,43.1,2.288,33,1

In [44]:
# Total Rows & columns
print("Shape :",df.shape)

Shape : (768, 9)

In [45]:
# Basic Statistics
df.describe()

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
count,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000
mean,3.845052,120.894531,69.105469,20.536458,79.799479,31.992578,0.471876,33.240885,0.348958
std,3.369578,31.972618,19.355807,15.952218,115.244002,7.884160,0.331329,11.760232,0.476951
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.078000,21.000000,0.000000
25%,1.000000,99.000000,62.000000,0.000000,0.000000,27.300000,0.243750,24.000000,0.000000
50%,3.000000,117.000000,72.000000,23.000000,30.500000,32.000000,0.372500,29.000000,0.000000
75%,6.000000,140.250000,80.000000,32.000000,127.250000,36.600000,0.626250,41.000000,1.000000
max,17.000000,199.000000,122.000000,99.000000,846.000000,67.100000,2.420000,81.000000,1.000000

1. Pregnancies, Glucose, BloodPressure, SkinThickness, Insulin	BMI	: Shows minimum is Zero which is not possible

In [47]:
# check all columns:
df.columns

Index(['Pregnancies', 'Glucose', 'BloodPressure', 'SkinThickness', 'Insulin',
       'BMI', 'DiabetesPedigreeFunction', 'Age', 'Outcome'],
      dtype='object')

In [48]:
columns=list(df)
columns

['Pregnancies',
 'Glucose',
 'BloodPressure',
 'SkinThickness',
 'Insulin',
 'BMI',
 'DiabetesPedigreeFunction',
 'Age',
 'Outcome']

In [51]:
# Checking Null Values
df.isnull().sum()

# Shows no null Values

Pregnancies                 0
Glucose                     0
BloodPressure               0
SkinThickness               0
Insulin                     0
BMI                         0
DiabetesPedigreeFunction    0
Age                         0
Outcome                     0
dtype: int64

In [58]:
# Calculate Total Zeroes In Glucose, Blood Pressure, SkinThickness, Insulin and BMI

(df[columns[1:6]]==0).sum()

Glucose            5
BloodPressure     35
SkinThickness    227
Insulin          374
BMI               11
dtype: int64

In [60]:
# Replace Statement
df[columns[1:6]]=df[columns[1:6]].replace(0,np.nan)

In [61]:
# Again Check Nan Values
df.isnull().sum()

Pregnancies                   0
Glucose                       5
BloodPressure                35
SkinThickness               227
Insulin                     374
BMI                          11
DiabetesPedigreeFunction      0
Age                           0
Outcome                       0
dtype: int64

In [62]:
df.shape

(768, 9)

In [63]:
# will drop null values
df.dropna(inplace=True)

In [64]:
df.shape

(392, 9)

### Dealing With Missing Values

1. Missing value

        df.isnull().sum()

2. Replace Value

        - df.fillna(df['colname'].mean(),inplace=True)
        - df.fillna(df['colname'].mode()[0],inplace=True)